lib/active_shipping/shipping/carriers/fedex/templates/quote.xml.erb

<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns='http://fedex.com/ws/rate/v16'>
  <soapenv:Header/>
  <soapenv:Body>
    <RateRequest>
      <WebAuthenticationDetail>
        <UserCredential>
          <Key><%= @key %></Key>
          <Password><%= @password %></Password>
        </UserCredential>
      </WebAuthenticationDetail>
      <ClientDetail>
        <AccountNumber><%= @accountNumber %></AccountNumber>
        <MeterNumber><%= @meterNumber %></MeterNumber>
      </ClientDetail>
      <TransactionDetail>
         <CustomerTransactionId>Intra_MX_Express_saver</CustomerTransactionId>
      </TransactionDetail>      
      <Version>
        <ServiceId>crs</ServiceId>
        <Major>16</Major>
        <Intermediate>0</Intermediate>
        <Minor>0</Minor>
      </Version>
      <ReturnTransitAndCommit>true</ReturnTransitAndCommit>
      <RequestedShipment>
        <ShipTimestamp><%= @ship_timestamp %></ShipTimestamp>
        <DropoffType>REGULAR_PICKUP</DropoffType>
        <PackagingType><%= @packaging_type %></PackagingType>
        <% if @envelope %>
          <TotalWeight>
             <Units>KG</Units>
             <Value><%= @document_weight -%></Value>
          </TotalWeight>        
        <% end %>        
        <% if @insured_value && @insured_currency %>
          <TotalInsuredValue>
            <Currency><%= @insured_currency %></Currency>
            <Amount><%= @insured_value %></Amount>            
          </TotalInsuredValue>
        <% end %>
        <% if @preferred_currency %>
          <PreferredCurrency><%= @preferred_currency %></PreferredCurrency>
        <% end %>
        <Shipper>
          <Address>
            <PostalCode><%= @shipper_postalcode %></PostalCode>
            <CountryCode><%= @shipper_countrycode %></CountryCode>
          </Address>
        </Shipper>
        <Recipient>
          <Address>
            <PostalCode><%= @recipient_postalcode %></PostalCode>
            <CountryCode><%= @recipient_countrycode %></CountryCode>
          </Address>
        </Recipient>
        <% if @envelope %>
          <RateRequestTypes>LIST</RateRequestTypes>
          <PackageCount>1</PackageCount>        
          <RequestedPackageLineItems>
            <SequenceNumber>1</SequenceNumber>       
            <GroupNumber>1</GroupNumber>                   
            <GroupPackageCount>1</GroupPackageCount>             
            <% if @insured_value && @insured_currency %>
              <InsuredValue>
                <Currency><%= @insured_currency %></Currency>
                <Amount><%= @insured_value %></Amount>
              </InsuredValue>    
            <% end %>                    
             <Weight>
               <Units>KG</Units>
               <Value><%= @document_weight -%></Value>
             </Weight>                            
          </RequestedPackageLineItems>        
        <% else %>        
          <RateRequestTypes>LIST</RateRequestTypes>
          <PackageCount><%= @package_count %></PackageCount>
          <% if @packages && @package_count > 0 %>
            <% @packages.each do |package| -%>
              <RequestedPackageLineItems>                    
                <GroupPackageCount><%= package.quantity %></GroupPackageCount>
                <% if @insured_value && @insured_currency %>            
                  <InsuredValue>
                    <Currency><%= @insured_currency %></Currency>
                    <Amount><%= @insured_value %></Amount>
                  </InsuredValue>                         
                <% end %>              
                <Weight>
                  <Units>KG</Units>
                  <Value><%= package.weight -%></Value>
                </Weight>
                <% if @packaging_type == "YOUR_PACKAGING" && package.length && package.width && package.height %>
                  <Dimensions>
                    <Length><%= package.length -%></Length>
                    <Width><%= package.width -%></Width>
                    <Height><%= package.height -%></Height>
                    <Units>CM</Units>
                  </Dimensions>            
                <% end -%>                              
              </RequestedPackageLineItems>
            <% end -%>          
          <% end -%>
        <% end -%>                                            
      </RequestedShipment>
    </RateRequest>
  </soapenv:Body>
</soapenv:Envelope>